{
    "heading1": "Vem är Christoffer Gylin?",
    "paragraphs": [
        "Jag är en kreativ fullstackutvecklare  som älskar utmaningar, att bygga hemsidor, appar och användargränssnitt, lösa problem och komma på nya spännande lösningar.",
        "Jag har alltid varit intresserad av teknik i allmänhet och datorer i synnerhet, och har sedan 7 års ålder använt en dator i princip varje dag. Det var tydligt redan tidigt att datorer var min grej och att det skulle bli en stor del av min framtid.",
        "Min första kontakt med programmering var under gymnasiet, för mer än 20 år sedan, då vi fick lära oss Assembler och C++. Det blev inte så mycket gjort med de kunskaperna, men jag började under samma period att på egen hand lära mig HTML, och startade snabbt en egen firma som hjälpte små och medelstora företag med deras hemsidor.",
        "Jag arbetade med webbdesign, datorservice och allmän IT-consulting i ett gäng år, men runt mitten av 00-talet blev jag mer och mer intresserad och engagerad i mitt andra intresse; musik, och bestämde mig år 2007 för att byta karriär och bli DJ.",
        "Till en början arrangerade jag mycket klubbar och spelade skivor på krogar och technofester, men till slut gled jag in på att spela i princip uteslutande på bröllop.",
        "2017 fick jag upp intresset för programmering igen då jag återupplivade mina gamla C++-kunskaper, började bygga diverse manicker med arduinos, och fick blodad tand.",
        "Runt 2019 började jag tröttna lite på DJ yrket och bestämde mig för att ta mig tillbaks till IT-branschen, och siktet var inställt på programmering i allmänhet, något jag alltid haft en stor fascination för, och webutveckling i synnerhet.",
        "Jag skrev in mig på kurserna \"Programmering 1\" och \"Digitalt Skapande 1\" på NTI Skolan för att komplettera mina gymnasiebetyg och började plugga. Efter att ha lärt mig grunderna i C# på NTI bestämde jag mig för att fortsätta lära mig webbutveckling på egen hand, och satte igång med att plöja tutorials och jobba med mina egna projekt.",
        "Under den här tiden hade jag fortsatt att arbeta som DJ parallellt med mitt lärande, men i slutet av 2019 kom pandemin och satte effektivt stopp för den karriären. Jag sålde min ljud- och ljusutrustning för att ha pengar att leva, och började lägga all min tid på programmeringen. Nu några år senare känner jag att jag har ganska bra koll på HTML, CSS och Javascript, och har ett flertal spännande projekt i portfolion.",
        "I juli 2024 tog jag examen från YH-utbildningen \"Frontend för Mobil och Web\" på Chas Academy, och arbetar nu som frilansande fullstackutvecklare."
    ]

}