{
    "heading1": "Who is Christoffer Gylin?",
    "paragraphs": [
        "I am a creative full-stack developer who loves challenges, building websites, apps, and user interfaces, solving problems, and coming up with new exciting solutions.",
        "I have always been interested in technology in general and computers in particular, and since the age of seven, I have used a computer almost every day. It was clear early on that computers were my thing and that they would become a major part of my future.",
        "My first encounter with programming was in high school, more than 20 years ago, when we learned Assembler and C++. I didn’t do much with those skills at the time, but during the same period, I started teaching myself HTML and quickly launched my own business, helping small and medium-sized companies with their websites.",
        "I worked with web design, computer service, and general IT consulting for several years, but around the mid-2000s, I became more and more interested in my other passion—music. In 2007, I decided to switch careers and become a DJ.",
        "At first, I organized club events and played records at bars and techno parties, but eventually, I ended up specializing almost exclusively in weddings.",
        "In 2017, my interest in programming reignited when I revisited my old C++ skills, started building various gadgets with Arduinos, and got hooked again.",
        "Around 2019, I started feeling a bit tired of the DJ profession and decided to return to the IT industry, with a focus on programming—something that has always fascinated me—especially web development.",
        "I enrolled in the courses \"Programming 1\" and \"Digital Creation 1\" at NTI School to supplement my high school grades and started studying. After learning the basics of C# at NTI, I decided to continue learning web development on my own, diving into tutorials and working on my own projects.",
        "During this time, I continued working as a DJ alongside my studies, but at the end of 2019, the pandemic hit and effectively put an end to that career. I sold my sound and lighting equipment to support myself and started dedicating all my time to programming. Now, a few years later, I feel confident in HTML, CSS, and JavaScript and have several exciting projects in my portfolio.",
        "In july 2024 I graduated from the Higher Vocational Education \"Frontend for Mobile and Web\" at Chas Academy, and is currently working as a free lance full-stack developer."
    ]

}