{
    "tagline": "Full Stack Developer",
    "introduction": {
        "heading": "Introduction",
        "paragraphs": [
            "I am an ambitious and curious full stack developer with focus on the front end, who is driven by a passion to explore new techniques and develop my competence. I have a lot of experience with modern tools like React, TypeScript and Tailwind CSS, and have well developed skills in Next.js. I have developed numerous projects, both personal and for clients, and have experience of using cloud services such as Azure, AWS, Heroku, Vercel and Linode/Akamai.",
            "For the most part of my career I have been an entrepreneur, operating  within the IT and music/event industries. This experience has not only taught me  to work independently with lots of personal responsibility, but also given me valuable experience of working, communicating, and collaborating with others, and the importance of being flexible and adaptable.",
            "I recently graduated from a higher vocational education, “Front end for mobile and web” at Chas Academy, where I have been learning more about the latest techniques in web development.",
            "My wide range of experience using computers spans almost my entire lifetime. I have worked with PC, Mac and Linux OS:es, and have a diverse computing history, including network administration, image editing in Photoshop, video editing in Premiere, music production in a wide range of software, database administration and design, programming, web design, web development, troubleshooting and repairing of computers and various other IT support duties.",
            "For more information about me and examples of my work, see my portfolio site at: https://christoffergylin.com and my GitHub profile at: https://github.com/ChristofferGylin"
        ]
    },
    "experience": {
        "heading": "Experience",
        "positions": [
            {
                "employer": "Reason Studios",
                "location": "Stockholm",
                "title": "Full Stack Developer Intern",
                "timeframe": "November 2023 - May 2024",
                "description": "During my internship as a Full Stack Developer at Reason Studios, a leading software development company within the music production industry, I have managed to learn a lot and further my competence in technologies like TypeScript, Next.js, Next-Auth, Jest, React Testing Library and Docker. I have also acquired experience in working according to agile principles in a real team, using related tools like Jira and Confluence."
            },
            {
                "employer": "Freelance",
                "location": "Stockholm",
                "title": "DJ",
                "timeframe": "2015 - 2020",
                "description": "During the period of 2015 to 2020 I was working as a freelancing DJ, specializing in weddings and private parties. I also did a large number of gigs at various bars and clubs, such as Solidaritet, Grill, Helenes Krog, Kolingsborg, Hotel Reisen, Oxid, and Fabriken."
            },
            {
                "employer": "Giertta Gylin Events",
                "location": "Stockholm",
                "title": "CEO, Event manager, DJ, Sales, Business Development",
                "timeframe": "2007 - 2015",
                "description": "In the role as CEO and event manager at Giertta Gylin Events I was responsible for running and administrating the company, planning and execution of weddings, parties and other events. I  also acted as DJ, and was responsible for organizing and promoting a number of nightclubs."
            },
            {
                "employer": "Databolaget Roland Thorberg AB",
                "location": "Huddinge",
                "title": "IT service technician intern",
                "timeframe": "2002",
                "description": "During my secondary education I did an internship at Databolaget Roland Thorberg AB as an IT service technician."
            },
            {
                "employer": "Gylin Design",
                "location": "Stockholm",
                "title": "CEO, Web designer, IT-support technician, Sales, Business Development",
                "timeframe": "2001-2013",
                "description": "As founder and CEO of Gylin Design, starting during my teenage years,  I was responsible for all aspects of running the company, including administration, bookkeeping, marketing and web design. Eventually the business developed into an IT-support company for consumers and small businesses."
            },
            {
                "employer": "S-Post",
                "location": "Stockholm",
                "title": "Telephone operator, database designer, database administrator",
                "timeframe": "2001-2004",
                "description": "I started my career at S-Post as a telephone operator, but eventually advanced to database designer and administrator."
            },
            {
                "employer": "Sportguiden",
                "location": "Stockholm",
                "title": "Event manager, video game reviewer",
                "timeframe": "2001",
                "description": "At Sportguiden, Sweden's first free newspaper, I was responsible for planning and execution of events, acting as a representative for the newspaper, and writing video game reviews."
            },
            {
                "employer": "Sekvencia AB",
                "location": "Stockholm",
                "title": " IT service technician intern",
                "timeframe": "2001",
                "description": "During my secondary education I did an internship at Sekvencia AB as an IT service technician."
            }
        ] 
    },
    "education": {
        "heading": "Education",
        "studies": [
            {
                "school": "Chas Academy",
                "location": "Stockholm",
                "subject": "Frontend for Mobile and Web",
                "timeframe": "September 2022 - July 2024",
                "description": "Higher vocational education"
            },
            {
                "school": "NTI Skolan",
                "location": "Stockholm",
                "subject": "Programming 1",
                "timeframe": "2020",
                "description": "Secondary education for adults (Gymnasial vuxenutbildning)"
            },
            {
                "school": "NTI Skolan",
                "location": "Stockholm",
                "subject": "Digital Creation 1",
                "timeframe": "2020",
                "description": "Secondary education for adults (Gymnasial vuxenutbildning)"
            },
            {
                "school": "Sjödalsgymnasiet",
                "location": "Stockholm",
                "subject": "Electrics and Data (\"El- Elektronik/Data\")",
                "timeframe": "1999-2002",
                "description": "Secondary education"
            }               
        ]
    },
    "skills": [
        "AWS",
        "Azure",
        "C#",
        "C/C++",
        "CSS",
        "Docker",
        "Express.js",
        "Git",
        "Heroku",
        "HTML",
        "JavaScript",
        "Jest",
        "Linode/Akamai",
        "MongoDB",
        "Mongoose",
        "MySQL",
        "Next.js",
        "Node.js",
        "Phaser 3",
        "Postgres",
        "Prisma",
        "React",
        "React Native",
        "React Testing Library",
        "Redux",
        "Socket.io",
        "Tailwind CSS",
        "Tone.js",
        "tRPC",
        "TypeScript"
    ]
}